{
    "properties": {
      "displayName": "Microsoft cloud security benchmark",
      "policyType": "BuiltIn",
      "description": "The Microsoft cloud security benchmark initiative represents the policies and controls implementing security recommendations defined in Microsoft cloud security benchmark, see https://aka.ms/azsecbm. This also serves as the Microsoft Defender for Cloud default policy initiative. You can directly assign this initiative, or manage its policies and compliance results within Microsoft Defender for Cloud.",
      "metadata": {
        "version": "57.11.1",
        "category": "Security Center"
      },
      "parameters": {
        "useServicePrincipalToProtectSubscriptionsMonitoringEffect": {
          "type": "String",
          "metadata": {
            "displayName": "[Deprecated]: Service principals should be used to protect your subscriptions instead of management certificates",
            "description": "[Deprecated: With Cloud Services (classic) retiring (see https://azure.microsoft.com/updates/cloud-services-retirement-announcement), there will no longer be a need for this assessment as management certificates will be obsolete.] Management certificates allow anyone who authenticates with them to manage the subscription(s) they are associated with. To manage subscriptions more securely, use of service principals with Resource Manager is recommended to limit the impact of a certificate compromise.",
            "deprecated": true
          },
          "allowedValues": [
            "AuditIfNotExists",
            "Disabled"
          ],
          "defaultValue": "Disabled"
        },
        "updateOsVersionMonitoringEffect": {
          "type": "String",
          "metadata": {
            "displayName": "[Deprecated]: Operating system version should be the most current version for your cloud service roles",
            "description": "Keeping the operating system (OS) on the most recent supported version for your cloud service roles enhances the systems security posture.",
            "deprecated": true
          },
          "allowedValues": [
            "AuditIfNotExists",
            "Disabled"
          ],
          "defaultValue": "Disabled"
        }
      } 
  },
    "id": "/providers/Microsoft.Authorization/policySetDefinitions/1f3afdf9-d0c9-4c3d-847f-89da613e70a8",
    "type": "Microsoft.Authorization/policySetDefinitions",
    "name": "Azure-Cloud-Security-BenchMark"
}